<template>
  <div class="main">
    <scroll-view class="scroll-roll" scroll-y>
      <div class="agreement">
        <h1>工程飞鱼隐私保护政策</h1>
        <br />
        <p>最新更新日期：2021年4月14日</p>
        <p>生效日期：2021年4月14日</p>
        <br />
        <p>
          <b>尊敬的用户：</b>比目鱼(北京)数字科技有限公司（以下亦称“工程飞鱼”或“我们”）非常重视客户个人信息及隐私权的保护，因此我们制订了涵盖如何收集、存储、使用、共享和保护客户信息的隐私政策。《工程飞鱼隐私保护政策》（以下简称“本隐私政策”）适用于工程飞鱼及其关联公司。如果我们代表我们的企业用户以处理者或服务提供方的身份处理个人信息数据，则本隐私政策不适用，包括我们向我们的企业用户提供工程飞鱼产品和服务，我们的企业用户（或其关联方）通过这些：（i）创建在我们的平台上运行的他们自己的网站和应用程序；（ii）出售或提供自己的产品和服务；（iii）向他人发送电子讯息；或（iv）通过我们的工程飞鱼产品和服务收集、使用、共享或处理个人数据。<br />
          请仔细阅读本隐私政策的全部条款，确认您已完全了解我们对您个人信息的处理规则，并作出您认为适当的选择。阅读过程中，您若有任何疑问，可通过发送邮件至bd@bimfish.com或拨打我们的客服电话（010-6471-7831）进行咨询；您若不同意协议中的任何条款，应立即停止访问我们的网站或使用我们所提供的产品或服务。<br />
          如您欲了解在使用工程飞鱼产品和服务的工程飞鱼企业用户和/或企业用户关联公司是控制人的情况下的隐私或数据安全的详细信息，请您直接与相关的企业用户联系。企业用户在隐私或数据安全方面的做法可能与本隐私声明所载的有差异，我们对其在隐私权或数据安全方面的做法不承担任何责任。<br />
          <br />
          <b>第一部分 定义</b><br />
          企业用户：是指购买或租用工程飞鱼产品及/或服务的组织。<br />
          个人用户：是指注册、登录、使用工程飞鱼服务的个人，在本协议中更多地称为“用户”或“您”。<br />
          个人信息：是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。<br />
          个人敏感信息：指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）儿童信息等的个人信息。<br />
          个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。<br />
          <br />
          <b>第二部分 本隐私政策将帮助您了解以下内容：</b><br />
          一、我们如何收集和使用您的个人信息<br />
          二、我们如何使用 Cookie 和同类技术<br />
          三、我们如何共享、转让、公开披露您的个人信息<br />
          四、我们如何保护和保存您的个人信息<br />
          五、您如何管理您的个人信息<br />
          六、未成年人的个人信息保护<br />
          七、通知和修订<br />
          八、如何联系我们<br />
          <br />
          <b>一、信息的收集和使用</b><br />
          为本隐私政策之目的，个人信息包括但不限于：基本信息（包括个人姓名、生日、性别、住址、个人头像照片、个人电话号码、个人电子邮箱、个人所属公司单位名称、岗位）；个人身份信息（包括身份证、军官证、护照、驾驶证等）；面部特征；网络身份标识信息（如电子签名、系统账户、账户名、账户昵称、IP地址、邮箱地址及与前述有关的密码、口令、口令保护答案）；个人财产信息（如银行帐号、支付宝信息、微信支付信息、房产信息、交易记录、交易账户等虚拟财产信息）；其他信息（如精准定位信息）。<br />
          在您使用工程飞鱼产品及/或服务时，我们及/或我们的企业用户需要/可能需要收集和使用的您的个人信息包括如下两种：<br />
          1、为实现向您提供工程飞鱼产品及/或服务的基本功能，您须授权我们及/或我们的企业用户收集、使用的必要的信息。如您拒绝提供相应信息，您将无法正常使用工程飞鱼产品及/或服务，工程飞鱼产品及/或服务的基本业务功能，包括注册用户服务、实现信息搜索和展示、交易及交易订单管理、审批及查看合同信息、客服及争议解决、保障交易安全所必须的功能；<br />
          2、为实现向您提供工程飞鱼产品及/或服务的附加功能，您可选择授权我们及/或我们的企业用户收集、使用的信息。如您拒绝提供，您将无法正常使用相关功能或无法达到我们拟达到的功能效果，但并不会影响您正常使用工程飞鱼产品及/或服务的基本功能。<br />
          您理解并同意：<br />
          1、我们致力于打造多样的产品和服务以满足您的需求。因我们向您提供的产品和服务种类众多，且不同用户选择使用的具体产品/服务范围存在差异，相应地，基本/附加功能及收集使用的个人信息类型、范围等会有所区别，请以具体的产品/服务功能为准；<br />
          2、为给您带来更好的产品和服务体验，我们在持续努力改进我们的技术，随之我们可能会不时推出新的或优化后的功能，可能需要收集、使用新的个人信息或变更个人信息使用目的或方式。对此，我们将通过更新本隐私政策、以弹窗、页面提示等方式另行向您说明对应信息的收集目的、范围及使用方式，并为您提供自主选择同意的方式，且在征得您明示同意后收集、使用。<br />
          在此过程中，如果您有任何疑问、意见或建议的，您可通过工程飞鱼官方客服（电话010-6471-7831）与我们联系，我们会尽快为您作出解答。<br />
          为本隐私政策之目的，我们及/或我们的企业用户仅会出于以下核心业务功能，收集和使用您的个人信息，如果您不提供相关信息，您将无法享受工程飞鱼产品和/或服务：<br />
          （一）帮助您成为我们的注册用户<br />
          1、 基础用户服务<br />
          我们的企业用户通过工程飞鱼账户为您提供基础用户服务。为注册成为用户并使用工程飞鱼的基础服务，您需要提供手机号码、拟使用的用户名和密码用于创建工程飞鱼账户。如果您仅需使用浏览、搜索服务，您不需要注册工程飞鱼账户及提供上述信息。<br />
          对于需要通过工程飞鱼才能使用的服务，我们的企业用户可能会根据您提供的上述信息校验您的用户身份，确保是在为您本人提供服务。<br />
          如您选择短信验证码方式登陆，您需要授权同意我们的企业用户调用您的短信接收和处理功能，向您发送短信以验证您的身份。<br />
          2、 附加用户服务<br />
          实人认证：为了更好的完成合同信息签订和查阅，您可以根据认证要求向我们的企业用户提供相应的身份信息（身份证、护照及其他身份证件信息）、生物识别特征（静态或动态的面部特征）、手机号码以完成实人认证。<br />
          实名认证：为了更好的完成合同信息签订和查阅，您可以根据认证要求向我们的企业用户提供相应的身份信息（身份证、护照及其他身份证件信息）、手机号码、所属企业以完成实名认证。<br />
          授权登录：经您同意后，我们的企业用户可能向第三方共享您的账户信息（头像、昵称及其他页面提示的信息），使您可以便捷地实现第三方账户的注册或登录。此外，我们的企业用户可能会根据您的授权从第三方处获取您的第三方账户信息，并与您的工程飞鱼账户进行绑定，使您可通过第三方账户直接登录、使用工程飞鱼产品及/或服务。我们的企业用户将在您授权同意的范围内使用您的相关信息。<br />
          3、 账户信息展示：<br />
          如果您已拥有工程飞鱼账户，我们的企业用户可能会在工程飞鱼上显示您的上述个人信息（实人认证、实名认证仅显示认证是否通过的结果），以及您在工程飞鱼或与工程飞鱼账户相关联的产品和服务中执行的操作，包括通过工程飞鱼集中展示您的个人资料、权益、奖励。<br />
          （二）实现信息搜索和展示所必须收集的信息<br />
          为了提供相关服务，我们及/或我们的企业用户可能会收集与房源相关的信息（包括房屋所有人联系电话、房屋位置信息、同住人信息）。<br />
          在您使用工程飞鱼产品及/或服务过程中，为识别账户异常状态、了解产品适配性、向您提供更契合您需求的页面展示和搜索结果、改进和优化前述功能，我们可能会自动收集您的使用情况并存储为网络日志信息，包括：<br />
          设备信息：我们及/或我们的企业用户会根据您在软件安装及/或使用中的具体操作，接收并记录您所使用的设备相关信息（包括设备型号、操作系统版本、设备设置、设备环境等软硬件特征信息）、设备所在位置相关信息（包括您授权的GPS位置以及WLAN接入点、蓝牙和基站等传感器信息）。<br />
          服务日志信息：当您使用工程飞鱼产品及/或服务时，我们及/或我们的企业用户会自动收集您对我们服务的详细使用情况，作为服务日志保存，以便更好地为您提供优质的服务。包括浏览、点击查看、搜索查询、登记问题、发起审批、发布信息，以及IP地址、浏览器类型、电信运营商、使用语言、访问日期和时间。<br />
          请您注意，如您的搜索关键词信息无法识别您的身份，其将不属于您的个人信息，我们及/或我们的企业用户有权在法律法规允许的范围内对其进行自主使用；只有当您的搜索关键词信息单独或与您的其他信息相互结合使用并可以识别您的身份时，则在单独或结合使用期间，我们及/或我们的企业用户会将您的搜索关键词信息作为您的个人信息，与您的搜索历史记录一同按照本隐私政策对其进行处理与保护。<br />
          为向您提供更便捷、更符合您个性化需求的信息展示、搜索及推送服务，我们及/或我们的企业用户会根据您的设备信息和服务日志信息，提取您的偏好特征，并基于特征标签产出间接人群画像，用于展示、推送信息和可能的商业广告。<br />
          如果您不想接受我们及/或我们的企业用户给您发送的商业广告，您可通过短信提示回复退订或我们及/或我们的企业用户提供的其他方式进行退订或关闭。在您使用我们及/或我们的企业用户提供的站内搜索服务时，我们及/或我们的企业用户也同时提供了不针对您个人特征的选项。<br />
          （三）客户服务及争议处理所必须收集的信息<br />
          当您需要我们及/或我们的企业用户提供客户服务时，我们及/或我们的企业用户的客服（包括呼叫中心及在线客服）会使用您的相关信息，主要包括账户信息，手机号码。<br />
          为保证您的账户安全，我们及/或我们的企业用户的呼叫中心客服和在线客服可能会对您的身份进行核验。待您的身份核验后，我们及/或我们的企业用户将会为您查询您所需要的相关信息。您有可能会在与我们及/或我们的企业用户的客服人员沟通时，提供给出上述信息外的其他信息。<br />
          为保障您的合法权益，保证我们及/或我们的企业用户的客户服务合法合规，并持续改进我及/或我们的企业用户们的客服能力，我们及/或我们的企业用户会对您与客服沟通的过程进行录音或文字留存，该留存信息仅会在法律所允许的期限和范围内予以留存和处理，并仅在基于您的维权需要、政府部门及司法部门的调查指令需要提供时，我们及/或我们的企业用户会进行必要披露。<br />
          为了提供服务及改进服务质量的合理需要，我们及/或我们的企业用户还可能使用的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。<br />
          （四）协同服务所必需收集的信息<br />
          为了给您提供更为高效的房屋维修、工程检查、设计变更服务，在取得您授权的前提下，我们的企业用户，需要收集您的如姓名、手机号码，并共享给协同合作机构。<br />
          协同合作机构都是与我们及/或我们的企业用户、工程飞鱼服务提供者签订书面合作协议、具备合法经营资质的机构。<br />
          （五）保障交易安全所必须收集的信息<br />
          为提高您使用工程飞鱼产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，我们及/或我们的企业用户可能会通过了解您的设备信息（如设备型号、设备识别码、设备标识符）、您的网络使用习惯（如浏览信息、常用软件信息）等手段来判断您的账户风险，并可能会记录一些我们认为有风险的链接（“URL”）；我们也会收集您的设备信息对于工程飞鱼系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。<br />
          （六）保障个人隐私信息安全所必须收集的信息<br />
          为了最大程度保障用户的个人隐私信息安全，保护用户免受钓鱼、欺诈、电话营销等困扰，我们的企业用户会为用户提供全面的号码隐私保护服务，覆盖客户维修服务、客户咨询等多个业务场景，我们的企业用户在该等服务场景中会收集您的相关信息，主要包括账户信息、手机号码。<br />
          （七）您可选择是否授权我们收集和使用您的个人信息的情形<br />
          1、为使您使用工程飞鱼产品及/或服务更便捷或更有乐趣，从而提升您在工程飞鱼产品及/或服务的体验，工程飞鱼产品及/或服务的以下附加功能中可能会收集和使用您的个人信息。如果您不提供这些个人信息，您依然可以使用工程飞鱼产品及/或服务中的核心功能，但您可能无法使用这些可以为您所带来更多乐趣的附加功能或在使用某些产品或服务时需要重复填写一些信息。这些附加功能包括：<br />
          （1）个性化推荐功能：我们的企业用户可能会收集您的工作记录、浏览信息、您设备的位置信息、您在工程飞鱼登记的相关业务信息进行数据分析以帮助您形成企业分析数据，并展示给您。 <br />
          （2）基于摄像头（相机）的附加功能：您可以使用这个附加功能完成视频拍摄、拍照、扫码以及人脸识别登录的功能。我们的企业用户可能会将人脸识别技术应用于更多场景，届时与您再次确认您是否愿意我们的企业用户使用您的面部信息来实现这些附加功能。<br />
          （3）基于图片上传的附加功能：您可以在工程飞鱼产品及/或服务上传您的照片来实现问题登记功能，我们的企业用户会使用您所上传的照片来解决相关服务问题，届时与您再次确认您是否愿意我们的企业用户使用前述信息来实现这个附加功能。<br />
          （4）基于语音技术的附加功能：您可以直接使用麦克风来与我们的企业用户客服机器人进行咨询和互动。在这些功能中我们的企业用户会处理您的录音内容，以识别您需求和客服与售后需求。届时与您再次确认您是否愿意我们的企业用户使用前述信息来实现这个附加功能。<br />
          （5）基于发送短信的附加功能：工程飞鱼产品及/或服务中的待办信息将通过短信、微信等第三方通讯工具发送给您。<br />
          （6）拨打电话的附加功能：如您需要和工程飞鱼产品及/或服务中登记的供应商进行联系，您可以直接查询相关供应商的联系人，拨打电话，拨打电话时，将显示您的电话将在对方来电显示。<br />
          （7）提供更便捷的服务：为了改进服务质量的合理需要，我们的企业用户可能会获得的您的其他信息，包括您与我们的企业用户项目授权信息、服务团队相关人员信息我们的企业用户获得的相关信息。<br />
          2、上述附加功能可能需要您在您的设备中向我们的企业用户开启您的地理位置（位置信息）、相机（摄像头）、相册（图片库）以及麦克风访问权限，以实现这些功能所涉及的信息的收集和使用。您可以在工程飞鱼客户端通过“系统设置->应用管理->权限管理”中逐项查看您上述权限的开启状态，并可以决定将这些权限随时的开启或关闭。请您注意，您开启这些权限即代表您授权我们的企业用户可以收集和使用这些个人信息来实现上述的功能，您关闭权限即代表您取消了这些授权，则我们的企业用户将不再继续收集和使用您的这些个人信息，也无法为您提供上述与这些授权所对应的功能。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。<br />
          （八）您充分知晓，以下情形中，我们收集、使用个人信息可能无需征得您的授权同意：<br />
          1、与国家安全、国防安全直接相关的；<br />
          2、与公共安全、公共卫生、重大公共利益直接相关的；<br />
          3、与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
          4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br />
          5、所收集的个人信息是您自行向社会公众公开的；<br />
          6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；<br />
          7、根据您的要求签订和履行合同所必需的；<br />
          8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；<br />
          9、法律法规规定的其他情形。<br />
          （九）我们及/或我们的企业用户从第三方获得您个人信息的情形<br />
          我们及/或我们的企业用户可能从第三方获取您授权共享的账户信息（头像、手机号码、昵称、城市 、地理位置），并在您同意本隐私政策后将您的第三方账户与您的工程飞鱼账户绑定，使您可以通过第三方账户直接登录并使用工程飞鱼产品与/或服务。我们及/或我们的企业用户会将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。<br />
          （十）您个人信息使用的规则<br />
          1、我们会根据本隐私政策的约定，在实现工程飞鱼产品与/或服务功能所必要的范围内，对所收集的个人信息进行使用。<br />
          2、在收集您的个人信息后，我们可能将通过技术手段对部分数据进行匿名化处理，匿名化处理的信息将无法识别主体。请您了解并同意，在此情况下我们有权使用已经匿名化的信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。<br />
          3、请您注意，您在使用我们的产品与/或服务时所提供的所有个人信息，除非您删除、通过系统设置或联系我们等方式撤回您的同意，否则将在您使用我们的产品与/或服务期间持续授权我们使用。你可以向我们的企业用户提出注销账号，在您注销账户后，我们将停止使用并删除您的个人信息。<br />
          4、我们会对工程飞鱼产品与/或服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示工程飞鱼的产品与/或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。<br />
          5、当我们展示您的个人信息时，我们会采用包括内容替换、去标识化处理等方式对您的信息进行脱敏，以保护您的信息安全。<br />
          6、当我们要将您的个人信息用于本隐私政策未载明的其它用途时，或基于特定目的收集而来的信息用于其他目的时，会要求您通过主动勾选的形式事先征求您的同意。<br />
          <br />
          <b>二、我们如何使用 Cookie 和同类技术</b><br />
          （一）Cookies的使用<br />
          1、为实现您联机体验的个性化需求，使您获得更轻松的访问体验。我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies 是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。我们向您发送Cookies是为了简化您重复登录的步骤、存储您的偏好或您浏览历史等数据进而为您提供偏好设置、帮助您优化对广告的选择与互动、帮助判断您的登录状态以及账户或数据安全。<br />
          2、我们不会将 Cookies 用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookies。您可以清除计算机上保存的所有 Cookies，大部分网络浏览器会自动接受Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookies；另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，您可能需要在每一次访问工程飞鱼网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。<br />
          （二）网络Beacon和同类技术的使用<br />
          除 Cookie 外，我们还会在网站上使用网络Beacon等其他同类技术。我们的网页上常会包含一些电子图像（称为“单像素” GIF 文件或“网络 beacon”）。我们使用网络beacon的方式有：<br />
          1、通过工程飞鱼使用网络beacon，计算用户访问数量，并通过访问 cookie 辨认注册的工程飞鱼用户。<br />
          2、通过得到的cookies信息，为您提供个性化服务。<br />
          <br />
          <b>三、我们如何共享、转让、公开披露您的个人信息</b><br />
          （一）共享<br />
          1、我们不会与工程飞鱼以外的任何公司、组织和个人共享您的个人信息，但以下情况除外：<br />
          （1）事先获得您明确的同意或授权；<br />
          （2）与国家安全、国防安全直接相关的；<br />
          （3）与公共安全、公共卫生、重大公共利益直接相关的；<br />
          （4）与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
          （5）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br />
          （6）自行向社会公众公开的个人信息；<br />
          （7）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。<br />
          2、经您授权后，我们可能会将您的个人信息与我们的关联方、协同服务机构、企业用户共享。我们只会共享必要的个人信息，并要求关联方、企业用户以不低于本隐私政策水平的方式保护您的个人信息，如我们会向其它您所在企业用户指定的OA系统提供您的用户名、电话等信息，以提供快捷的集成登录。我们的关联方、企业用户如要改变个人信息的处理目的，将再次征求您的授权同意。就上述关联方、企业用户向您提供的服务，我们对该等关联方、企业用户提供的服务性质与质量不作任何承诺或承担任何责任，对该等关联方、企业用户独立进行的用户信息采集和处理行为也不作任何承诺或承担任何责任。有关您在使用关联方、企业用户服务中相关的隐私控制和选项，以及服务提供者的隐私规定，请您谨慎参阅该等关联方、企业用户所提供的隐私政策。<br />
          3、经您授权后，我们可能会向合作伙伴共享您的账户信息、设备信息以及位置信息，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。 我们的合作伙伴包括以下类型：<br />
          委托我们进行推广的合作伙伴。有时我们会代表其他企业向使用我们产品与/或服务的用户群提供促销推广的服务。我们可能会使用您的个人信息以及您的非个人信息集合形成的间接用户画像与委托我们进行推广的合作伙伴（“委托方”）共享，但我们仅会向这些委托方提供推广的覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。<br />
          4、对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明以及其他任何相关的保密和安全措施来处理个人信息。在个人敏感数据使用上，我们要求第三方采用数据脱敏和加密技术，从而更好地保护用户数据。<br />
          （二）转让与公开披露<br />
          在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。<br />
          除本隐私政策所明确述明的情况以外，我们不会将您的个人信息转让或公开披露给任何公司、组织和个人，但以下情况除外：<br />
          1、与国家安全、国防安全直接相关的；<br />
          2、与公共安全、公共卫生、重大公共利益直接相关的；<br />
          3、与犯罪侦查、起诉、审判和判决执行等直接相关的；<br />
          4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br />
          5、您向社会公众公开的个人信息；<br />
          6、从合法公开披露的信息中收集的您的个人信息，如合法的新闻报道、政府信息公开等渠道。<br />
          （三）关于第三方插件管理<br />
          为了给您提供更专业、安全的核心业务功能和附加业务功能，工程飞鱼产品中会接入第三方插件产品（包括在我们的网页或应用程序中部署统计分析工具、软件开发工具包SDK、调用地图API接口）。<br />
          目前Android系统在工程飞鱼产品中存在的第三方插件披露如下：<br />
          1、 百度地图（baidu_map）收集您的设备信息、位置信息以及网络状态，为您提供当前项目位置快速定位服务；<br />
          2、 QQ SDK（open_sdk）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享；<br />
          3、 微博SDK（weibo.sdk）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享；<br />
          4、 微信SDK（tencent.wechat）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享、微信支付功能；<br />
          7、 个推（getui）收集您的设备信息，根据您的选择或指令向您提供待办任务推送服务；根据您的网络状态提供联网策略的优化服务以及联网信号的识别功能；<br />
          iOS系统中工程飞鱼产品使用的第三方插件如下：<br />
          1、 百度地图（baidu_map）收集您的设备信息、位置信息以及网络状态，为您提供当前项目位置快速定位服务；<br />
          2、 QQ SDK（open_sdk）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享；<br />
          3、 微博SDK（weibo.sdk）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享；<br />
          4、 微信SDK（tencent.wechat）收集您的网络状态信息，以根据您的指令实现账号的登陆、以及信息的分享、微信支付功能；<br />
          5、 个推（getui）收集您的设备信息，根据您的选择或指令向您提供待办任务推送服务；根据您的网络状态提供联网策略的优化服务以及联网信号的识别功能；<br />
          以上插件会根据产品功能收集您的个人信息，我们仅会在您授权同意开通相关功能或在您主动使用相关功能我们给予充分提示时，才会将您的对应个人信息接口授权给上述第三方插件。<br />
          <br />
          <b>四、我们如何保护和保存您的个人信息</b><br />
          （一）我们保护您个人信息的技术与措施<br />
          我们非常重视个人信息安全，并采取一切合理可行的措施，保护您的个人信息：<br />
          1、 数据安全技术措施<br />
          工程飞鱼采取安全技术和管理措施来防止您的个人信息遭到未经授权访问使用、公开披露、使用、修改、损坏或丢失，包括但不限于：<br />
          （1）工程飞鱼采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用包括内容替换在内多种数据脱敏技术增强个人信息在使用中安全性；<br />
          （2）工程飞鱼采取严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用；<br />
          （3）工程飞鱼采取数据访问日志分析技术进行个人信息安全审计。<br />
          2、 工程飞鱼为保护企业用户及个人信息采取的其他安全措施<br />
          安全制度保障：工程飞鱼发布了《数据安全白皮书》和《员工信息安全奖惩办法》，通过制度规范工程飞鱼各部门对个人信息所采取的管理措施。<br />
          安全认证和服务：我们存储您个人数据的底层云技术由国内 公有云厂商（腾讯云）提供，同时我们还通过国家公安部安全等级保护三级测评， 国际ISO27001认证、CSA-STAR认证。<br />
          加强安全意识：我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。<br />
          3、 我们建议您使用电子邮件、即时通讯、社交软件等与其他用户的交流工具时请使用复杂密码，并注意保护您的个人信息安全。<br />
          4、 我们将尽力确保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。<br />
          5、 安全事件处置<br />
          为应对个人信息泄露、损毁和丢失的风险，工程飞鱼制定了多项制度并成立了应急响应团队。我们按照安全事件的处置规范，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、联合相关部门进行溯源和打击。<br />
          在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br />
          6、 如果您发现自己的个人信息泄密或我们存在有安全弱点、可疑安全事件时，尤其是您的账户及密码发生泄露，请您立即通过本隐私政策最下方约定的联系方式联络我们，以便我们采取相应措施，禁止私自尝试或验证弱点。<br />
          7、 如果您对我们的个人信息保护有任何疑问，可通过本隐私政策最下方约定的联系方式联系我们。<br />
          （二）您个人信息的保存<br />
          1、您的个人信息将会被存储于中华人民共和国境内。如您使用跨境交易服务，且需要向境外传输您的个人信息完成交易的，或基于其他必要的业务需要确需将您的个人信息传输至境外，我们会单独征得您的授权同意并要求接收方按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理这些个人信息。<br />
          2、当您成功申请注销工程飞鱼账户后，我们将在您提出申请的48小时内完成对您的账户注销审核，审核通过后，我们将对您的个人信息进行删除或匿名化处理。<br />
          3、如果我们终止服务或运营，我们会至少提前三十日向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理。<br />
          <br />
          <b>五、您如何管理您的个人信息</b><br />
          工程飞鱼非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：<br />
          1、访问和更正您的个人信息<br />
          除法律法规规定外，您有权随时访问和更正您的个人信息，具体包括：<br />
          （1）您的账户信息：您可以在工程飞鱼移动端App访问和更正您的个人信息；具体路径为：“我的”进入我的相关信息--点击头像进入“我的个人信息”设置。<br />
          （2）对于您在使用我们的产品与/或服务过程中产生的其他个人信息需要访问或更正，请随时联系我们。我们会根据本隐私政策所列明的方式和期限响应您的请求。<br />
          （3）您无法访问和更正的个人信息：除上述列明的信息外，您的部分个人信息我们还无法为您提供访问和更正的服务，这些信息主要是为了提升您的用户体验和保证交易安全所收集的您的设备信息、您使用附加功能时产生的个人信息。上述信息我们会在您的授权范围内进行使用，您无法访问和更正，但您可通过发送邮件至bd@bimfish.com或拨打我们的客服电话（010-6471-7831）联系我们进行删除或做匿名化处理。<br />
          2、删除您的个人信息<br />
          您在我们的产品与/或服务页面中可以直接清除或删除的信息，包括点评与问答记录、关注或浏览信息、搜索订阅信息；<br />
          在以下情形中，您可以向我们提出删除个人信息的请求：<br />
          （1）如果我们处理个人信息的行为违反法律法规；<br />
          （2）如果我们收集、使用您的个人信息，却未征得您的同意；<br />
          （3）如果我们处理个人信息的行为违反了与您的约定；<br />
          （4）如果您注销了工程飞鱼账户；<br />
          （5）如果我们终止服务及运营。<br />
          若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
          3、改变您授权同意的范围或撤回您的授权<br />
          您可以通过删除信息、关闭设备功能、在工程飞鱼软件中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集、处理您个人信息的全部授权。<br />
          请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。<br />
          4、注销账户和调整权限<br />
          您可以在您所服务的企业管理后台-用户管理，进行账户的删除或者通过用户授权调整相关权限。如果您是企业用户的供应商，相关企业管理员会根据您所签订的合同相关信息对您的权限进行审核并授予和取消权限。您注销账户后，我们将停止为您提供产品与/或服务，并依据您的要求，除法律法规另有规定外，我们将及时删除您的个人信息。<br />
          您的账户一旦注销，将面临如下风险及问题：<br />
          （1）您原来看可查看和处理的所有业务都无法进行，包括不限于工作流程处理、报表查看等；<br />
          （2）如您的账户因违法违规操作或侵犯他人合法权益导致处罚或纠纷，我们将在必要的期限内保留处理此纠纷、投诉所必要的信息，并在该等期限届满后对相关个人信息进行删除或匿名化处理。<br />
          5、如果您不想接受我们给您发送的信息，您随时可通过以下方式取消：<br />
          （1）您可以通过移动端APP“我-设置-推送设置”，设置是否接受我们通过“通知”推送给您的信息。<br />
          （2）我们会与第三方的平台或媒体（“平台”）合作基于您的个人信息向您推荐个性化的商品或服务。这些个人信息包括诸如在本网站的产品与/或服务的使用情况、访问本网站关联公司网站的情况。平台仅向我们提供了展示商品的窗口，窗口内容的链接是工程飞鱼站内的个性化商品展示信息，由工程飞鱼进行管理，因此我们不会向广告商提供您的任何的个人信息。而且我们在推荐窗内设置了屏蔽功能，您可选择屏蔽您不喜欢的广告。如您不愿意接受明源云在单个平台上的推荐服务，请联系平台进行关闭。您知晓并理解平台是自主经营的实体，工程飞鱼无法对其进行管理。<br />
          （3）为了保护您的隐私，我们不会以任何方式和途径向您推送涉及宗教信仰、性、疾病等相关敏感内容的促销或商品信息给您。<br />
          6、响应您的请求<br />
          如果您无法通过上述方式访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们产品与/或服务时所产生的其他个人信息，或您认为工程飞鱼存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您均可以发送电子邮件至bd@bimfish.com或通过拨打我们的客服电话（010-6471-7831）等多种方式与我们联系。<br />
          为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的十五（15）天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。<br />
          在以下情形中，按照法律法规要求，我们将可能无法响应您的请求：<br />
          （1）与国家安全、国防安全直接相关的；<br />
          （2）与公共安全、公共卫生、重大公共利益直接相关的；<br />
          （3）与犯罪侦查、起诉、审判和执行判决等直接相关的；<br />
          （4）有充分证据表明您存在主观恶意或滥用权利的；<br />
          （5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br />
          （6）涉及商业秘密的。<br />
          <br />
          <b>六、未成年人的个人信息保护</b><br />
          1、工程飞鱼非常重视对未成年人个人信息的保护。您若是18周岁以下的未成年人，在使用我们的产品与/或服务前，应事先取得您家长或法定监护人的同意。工程飞鱼根据国家相关法律法规的规定保护未成年人的个人信息。<br />
          2、对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。<br />
          3、我们如果发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。<br />
          <br />
          <b>七、通知和修订</b><br />
          1、为给您提供更好的服务以及随着工程飞鱼产品及或服务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在工程飞鱼产品及或服务所涉网站或客户端等上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问明源云官方网站便及时了解最新的隐私政策。<br />
          2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。<br />
          本隐私政策所指的重大变更包括但不限于：<br />
          （1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；<br />
          （2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；<br />
          （3）个人信息共享、转让或公开披露的主要对象发生变化；<br />
          （4）您参与个人信息处理方面的权利及其行使方式发生重大变化；<br />
          （5）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；<br />
          （6）个人信息安全影响评估报告表明存在高风险时。<br />
          3、我们还会将本策略的旧版本存档，供您查阅。<br />
          <br />
          <b>八、如何联系我们</b><br />
          1、如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请通过发送邮件至bd@bimfish.com或拨打我们的客服电话（010-6471-7831）等多种方式与我们联系。<br />
          2、我们设立了个人信息保护专职部门（或个人信息保护专员），您可以通过发送邮件至bd@bimfish.com的方式与其联系。<br />
          我们谨此再次提醒您，本隐私政策内容中以加粗方式显著标识的条款，请您着重阅读。如您点击或勾选“同意”并确认提交，即视为您完全理解并同意本隐私政策的全部内容且承诺受本隐私政策之约束。<br />
          <br />
        </p>
      </div>
    </scroll-view>
  </div>
</template>

<script>
export default {
  data() {
    //这里存放数据
    return {}
  },
  mounted() {},
  //方法集合
  methods: {}
}
</script>
<style lang="less" scoped>
@import url('./policy.less');
</style>
